# Creating DataFrames

In [2]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'a': [4,5,6], 'b':[7,8,9], 'c':[10, 11, 12]})
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [3]:
df1 = pd.DataFrame({'a': [4,5,6], 'b':[7,8,9], 'c':[10, 11, 12]}, index = [1,2,3])
df1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df2 = pd.DataFrame([[2,3,4], [5,6,7], [8,9,10]])
df2

   0  1   2
0  2  3   4
1  5  6   7
2  8  9  10

In [5]:
df3 = pd.DataFrame({'a':[1,2,3], 'b':[4,5,6], 'c':[7,8,9]}, index = pd.MultiIndex.from_tuples([('d',2), ('d',3), ('n', 6)], names = ['r', 'c']))
df3

     a  b  c
r c
d 2  1  4  7
  3  2  5  8
n 6  3  6  9

In [6]:
df4 = pd.DataFrame({'a':[2,4,6], 'b':[1,3,5], 'c':[6,7,8]}, index = pd.MultiIndex.from_tuples([('d', 40), ('d', 88), ('c', 64)], names = ['r', 'c']))
df4

      a  b  c
r c
d 40  2  1  6
  88  4  3  7
c 64  6  5  8

# Reshaping Data (Change Layout, Sorting, Reindexing, Renaming)

### Get Columns into Rows

In [7]:
df5 = pd.DataFrame({'a':[2,3,4], 'b':[5,6,7], 'c':[8,9,10]})
df5

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [8]:
df6 = pd.melt(df5)
df6

  variable  value
0        a      2
1        a      3
2        a      4
3        b      5
4        b      6
5        b      7
6        c      8
7        c      9
8        c     10

### Spread rows into columns.

In [9]:
df7 = pd.DataFrame({'x':[12,34,45], 'y':[34,67,56], 'z':[16,32,76]})
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [10]:
ts = pd.melt(df7)
ts

  variable  value
0        x     12
1        x     34
2        x     45
3        y     34
4        y     67
5        y     56
6        z     16
7        z     32
8        z     76

In [11]:
st = df7.pivot(columns = 'x', values = 'y')
st

x    12    34    45
0  34.0   NaN   NaN
1   NaN  67.0   NaN
2   NaN   NaN  56.0

In [12]:
st = df7.pivot(columns = 'x', values = ['y','z'])
st

      y                 z
x    12    34    45    12    34    45
0  34.0   NaN   NaN  16.0   NaN   NaN
1   NaN  67.0   NaN   NaN  32.0   NaN
2   NaN   NaN  56.0   NaN   NaN  76.0

In [13]:
df = pd.DataFrame({'fff': ['one', 'one', 'one', 'two', 'two',
              'two'],
          'bbb': ['P', 'Q', 'R', 'P', 'Q', 'R'],
          'baa': [2, 3, 4, 5, 6, 7],
          'zzz': ['h', 'i', 'j', 'k', 'l', 'm']})
rc = pd.melt(df)
rc

   variable value
0       fff   one
1       fff   one
2       fff   one
3       fff   two
4       fff   two
5       fff   two
6       bbb     P
7       bbb     Q
8       bbb     R
9       bbb     P
10      bbb     Q
11      bbb     R
12      baa     2
13      baa     3
14      baa     4
15      baa     5
16      baa     6
17      baa     7
18      zzz     h
19      zzz     i
20      zzz     j
21      zzz     k
22      zzz     l
23      zzz     m

In [14]:
import pandas as pd 
df = pd.DataFrame({'fff': ['one', 'one', 'one', 'two', 'two', 'two'],
          'bbb': ['P', 'Q', 'R', 'P', 'Q', 'R'],
          'baa': [2, 3, 4, 5, 6, 7],
          'zzz': ['h', 'i', 'j', 'k', 'l', 'm']})
df.pivot(index='fff', columns='bbb', values='baa')
print(df)

   fff bbb  baa zzz
0  one   P    2   h
1  one   Q    3   i
2  one   R    4   j
3  two   P    5   k
4  two   Q    6   l
5  two   R    7   m

### Append rows of DataFrames

In [151]:
df5

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10

In [152]:
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [153]:
var = pd.concat([df5, df7])
var

     a    b     c     x     y     z
0  2.0  5.0   8.0   NaN   NaN   NaN
1  3.0  6.0   9.0   NaN   NaN   NaN
2  4.0  7.0  10.0   NaN   NaN   NaN
0  NaN  NaN   NaN  12.0  34.0  16.0
1  NaN  NaN   NaN  34.0  67.0  32.0
2  NaN  NaN   NaN  45.0  56.0  76.0

In [156]:
var = pd.concat([df5, df7], axis = 0)
var

     a    b     c     x     y     z
0  2.0  5.0   8.0   NaN   NaN   NaN
1  3.0  6.0   9.0   NaN   NaN   NaN
2  4.0  7.0  10.0   NaN   NaN   NaN
0  NaN  NaN   NaN  12.0  34.0  16.0
1  NaN  NaN   NaN  34.0  67.0  32.0
2  NaN  NaN   NaN  45.0  56.0  76.0

In [154]:
var = pd.concat([df5, df7], axis = 1)
var

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

In [155]:
var = pd.concat([df5, df7], ignore_index=True)
var

     a    b     c     x     y     z
0  2.0  5.0   8.0   NaN   NaN   NaN
1  3.0  6.0   9.0   NaN   NaN   NaN
2  4.0  7.0  10.0   NaN   NaN   NaN
3  NaN  NaN   NaN  12.0  34.0  16.0
4  NaN  NaN   NaN  34.0  67.0  32.0
5  NaN  NaN   NaN  45.0  56.0  76.0

### Append columns of DataFrames

In [159]:
var = pd.concat([df5, df7], axis=1)
var

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

### Sorting

In [21]:
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

### Order rows by values of a column (low to high).

In [22]:
df7.sort_values('y')

    x   y   z
0  12  34  16
2  45  56  76
1  34  67  32

### Order rows by values of a column (high to low).

In [23]:
df7.sort_values('x', ascending = False)

    x   y   z
2  45  56  76
1  34  67  32
0  12  34  16

### Rename the columns of a DataFrame

In [24]:
df7.rename(columns = {'y': 'year'})

    x  year   z
0  12    34  16
1  34    67  32
2  45    56  76

In [25]:
df7.rename(columns = {'x': 'ram', 'z': 'zebra'})

   ram   y  zebra
0   12  34     16
1   34  67     32
2   45  56     76

### Sort the index of a DataFrame

In [26]:
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [27]:
df7.sort_index(1)

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_29656\740482527.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  df7.sort_index(1)

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [28]:
df7.sort_index(1, ascending = False)

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_29656\3705127782.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  df7.sort_index(1, ascending = False)

    z   y   x
0  16  34  12
1  32  67  34
2  76  56  45

In [29]:
sot = df7.sort_index(0, ascending = False)
sot

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_29656\3670682515.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  sot = df7.sort_index(0, ascending = False)

    x   y   z
2  45  56  76
1  34  67  32
0  12  34  16

In [30]:
ind = df7.sort_index(0)
ind

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_29656\658919262.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.sort_index will be keyword-only.
  ind = df7.sort_index(0)

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

### Reset index of DataFrame to row numbers, moving index to columns.

In [31]:
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [32]:
sot.reset_index()

   index   x   y   z
0      2  45  56  76
1      1  34  67  32
2      0  12  34  16

### Drop columns from DataFrame

In [33]:
df7

    x   y   z
0  12  34  16
1  34  67  32
2  45  56  76

In [34]:
df7.drop(columns = 'y')

    x   z
0  12  16
1  34  32
2  45  76

In [35]:
df7.drop(columns = 'x')

    y   z
0  34  16
1  67  32
2  56  76

# Subset Observations - Rows

### Extract rows that meet logical criteria.

In [36]:
# df7[df7.len > 1]     -->> Error
print(len(df7)>2)

True

In [37]:
print(len(df7)>2)

True

In [38]:
df10 = pd.DataFrame({'p':[15,21,3,4,54], 'q':[6,7,8,9,10], 'r':[11,12,13,14,16], 's':[17,18,19,20,21], 't':[22,23,24,25,15]})
df10

    p   q   r   s   t
0  15   6  11  17  22
1  21   7  12  18  23
2   3   8  13  19  24
3   4   9  14  20  25
4  54  10  16  21  15

In [39]:
df10.drop_duplicates()

    p   q   r   s   t
0  15   6  11  17  22
1  21   7  12  18  23
2   3   8  13  19  24
3   4   9  14  20  25
4  54  10  16  21  15

In [40]:
df11 = pd.DataFrame({'l':[12, 12,14,16], 'm':[45,45,15,16], 'n':[12,12,15,16]})
df11

    l   m   n
0  12  45  12
1  12  45  12
2  14  15  15
3  16  16  16

In [177]:
df11.drop_duplicates()

    l   m   n
0  12  45  12
2  14  15  15
3  16  16  16

In [41]:
df11.drop_duplicates(subset = ['l', 'm', 'n'])

    l   m   n
0  12  45  12
2  14  15  15
3  16  16  16

In [42]:
df11.drop_duplicates(subset = ['l', 'm'], keep = 'last')

    l   m   n
1  12  45  12
2  14  15  15
3  16  16  16

### Randomly select fraction of rows.

In [43]:
df12 = pd.DataFrame({'f':[3,4,5,6,7], 'g':[8,5,2,4,6], 'h':[22,4,5,12,56], 'i':[77,58,34,68,98]})
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [44]:
df12.sample(frac=0.8)

   f  g   h   i
2  5  2   5  34
0  3  8  22  77
3  6  4  12  68
4  7  6  56  98

In [45]:
df12.sample(frac=0.5)

   f  g   h   i
4  7  6  56  98
0  3  8  22  77

### Randomly select n rows.

In [46]:
df12.sample(n = 5)

   f  g   h   i
3  6  4  12  68
0  3  8  22  77
2  5  2   5  34
1  4  5   4  58
4  7  6  56  98

In [47]:
df12.sample(n=3)

   f  g   h   i
1  4  5   4  58
2  5  2   5  34
0  3  8  22  77

### Select and order top n entries.  (column number with column name)

In [48]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [49]:
df12.nlargest(3, 'f')

   f  g   h   i
4  7  6  56  98
3  6  4  12  68
2  5  2   5  34

In [50]:
df12.nlargest(10, 'i')

   f  g   h   i
4  7  6  56  98
0  3  8  22  77
3  6  4  12  68
1  4  5   4  58
2  5  2   5  34

### Select and order bottom n entries.

In [51]:
df12.nsmallest(4, 'h')

   f  g   h   i
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
0  3  8  22  77

### Select first n rows.

In [52]:
df12.head()

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

### Select last n rows.

In [53]:
df12.tail()

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

# Subset Variables - Columns

In [54]:
# df[['width, 'length, 'species']]
# Select multiple columns with specific names.
# df['width'] or df.width
# Select single column with specific name.

### Select columns whose name matches regular expression regex.

In [55]:
df12.filter(items = ['f', 'h'])

   f   h
0  3  22
1  4   4
2  5   5
3  6  12
4  7  56

In [56]:
df12.filter(regex = '$', axis = 1)

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [57]:
df12.filter(regex = '$', axis = 0)

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [58]:
# df12.filter(like=2, axis=0)   #--->> This can be used only if we have index in string form (ex: rabbit (considering only bbi))

# Subsets - Rows and Columns

### Select rows 10-20.

In [59]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [60]:
df12.loc[1:5]

   f  g   h   i
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [61]:
df12.loc[2:4]

   f  g   h   i
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [62]:
df12.iloc[2:3]

   f  g  h   i
2  5  2  5  34

In [63]:
df12.iloc[1:4]

   f  g   h   i
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68

### Select columns in positions 1, 2 and 5 (first column is 0).

In [64]:
df12.iloc[:, [1,2,3]]

   g   h   i
0  8  22  77
1  5   4  58
2  2   5  34
3  4  12  68
4  6  56  98

In [65]:
df12.iloc[:, [2,2,3]]

    h   h   i
0  22  22  77
1   4   4  58
2   5   5  34
3  12  12  68
4  56  56  98

In [66]:
df12.iloc[:, [1,2,2]]

   g   h   h
0  8  22  22
1  5   4   4
2  2   5   5
3  4  12  12
4  6  56  56

In [67]:
df12.iloc[:, [2, 1, 2]]

    h  g   h
0  22  8  22
1   4  5   4
2   5  2   5
3  12  4  12
4  56  6  56

## Select rows meeting logical condition, and only the specific columns .

### Access single value by index

In [68]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [69]:
df12.iat[1, 3]

58

### Access single value by label

In [70]:
df12.at[4, 'g']

6

# Summarize

### Count number of rows with each unique value of variable

In [71]:
df11['l'].value_counts()

12    2
14    1
16    1
Name: l, dtype: int64

In [72]:
df12['h'].value_counts()

22    1
4     1
5     1
12    1
56    1
Name: h, dtype: int64

### # of rows in DataFrame.

In [73]:
len(df12)

5

## Tuple of # of rows, # of columns in DataFrame.

In [74]:
df12.shape

(5, 4)

### of distinct values in a column.

In [75]:
df11

    l   m   n
0  12  45  12
1  12  45  12
2  14  15  15
3  16  16  16

In [76]:
df11['l'].nunique

<bound method IndexOpsMixin.nunique of 0    12
1    12
2    14
3    16
Name: l, dtype: int64>

In [77]:
df12['i'].nunique

<bound method IndexOpsMixin.nunique of 0    77
1    58
2    34
3    68
4    98
Name: i, dtype: int64>

# Basic descriptive and statistics for each column (or GroupBy).

In [78]:
df11.describe()

               l          m          n
count   4.000000   4.000000   4.000000
mean   13.500000  30.250000  13.750000
std     1.914854  17.036725   2.061553
min    12.000000  15.000000  12.000000
25%    12.000000  15.750000  12.000000
50%    13.000000  30.500000  13.500000
75%    14.500000  45.000000  15.250000
max    16.000000  45.000000  16.000000

pandas provides a large set of summary functions that operate on different kinds of pandas objects (DataFrame columns, Series, GroupBy, Expanding and Rolling (see below)) and produce single values for each of the groups. When applied to a DataFrame, the result is returned as a pandas Series for each column. Examples:

### Sum values of each object.

In [79]:
df11.sum()

l     54
m    121
n     55
dtype: int64

### Count non-NA/null values of each object.

In [80]:
df11.count()

l    4
m    4
n    4
dtype: int64

### Mean value of each object.

In [81]:
df11.mean()

l    13.50
m    30.25
n    13.75
dtype: float64

### Standard deviation of each object.

In [82]:
df11.std()

l     1.914854
m    17.036725
n     2.061553
dtype: float64

### Median value of each object.

In [83]:
df12.median()

f     5.0
g     5.0
h    12.0
i    68.0
dtype: float64

### Minimum value in each object.

In [84]:
df12.min()

f     3
g     2
h     4
i    34
dtype: int64

### Maximum value in each object.

In [85]:
df12.max()

f     7
g     8
h    56
i    98
dtype: int64

### Quantiles of each object.

In [86]:
df12.quantile([0.12, 0.75])

         f     g      h      i
0.12  3.48  2.96   4.48  45.52
0.75  6.00  6.00  22.00  77.00

In [87]:
df12.quantile([0.012, 0.12])

           f      g      h       i
0.012  3.048  2.096  4.048  35.152
0.120  3.480  2.960  4.480  45.520

### Apply function to each object.

In [88]:
df11

    l   m   n
0  12  45  12
1  12  45  12
2  14  15  15
3  16  16  16

In [89]:
df11.apply(np.sqrt)

          l         m         n
0  3.464102  6.708204  3.464102
1  3.464102  6.708204  3.464102
2  3.741657  3.872983  3.872983
3  4.000000  4.000000  4.000000

In [90]:
df11.apply(np.sum)

l     54
m    121
n     55
dtype: int64

In [91]:
df11.apply(np.sum, axis = 1)

0    69
1    69
2    44
3    48
dtype: int64

In [92]:
df11.apply(np.sum, axis=0)

l     54
m    121
n     55
dtype: int64

# Handling Missing Data

### Drop rows with any column having NA/null data.

In [93]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [94]:
df12.dropna()

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [95]:
var

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

In [96]:
var.dropna()

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

### Replace all NA/null data with value.

In [97]:
var.fillna('a')

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

In [98]:
var.fillna(34)

   a  b   c   x   y   z
0  2  5   8  12  34  16
1  3  6   9  34  67  32
2  4  7  10  45  56  76

In [99]:
df12.fillna('Nan')

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

# Make New Columns

### Compute and append one or more new columns.

In [100]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [101]:
df12.assign(a = lambda x : x.f*9/5 +32)

   f  g   h   i     a
0  3  8  22  77  37.4
1  4  5   4  58  39.2
2  5  2   5  34  41.0
3  6  4  12  68  42.8
4  7  6  56  98  44.6

In [102]:
df12.assign(b = df12['g']*9/5 + 32)

   f  g   h   i     b
0  3  8  22  77  46.4
1  4  5   4  58  41.0
2  5  2   5  34  35.6
3  6  4  12  68  39.2
4  7  6  56  98  42.8

### Add single column.

In [103]:
# df['Volume'] = df12.Length*df12.Height*df12.Depth

### Bin column into n buckets.

In [104]:
bucket = pd.qcut(df12['i'], 2, labels = False)
bucket

0    1
1    0
2    0
3    0
4    1
Name: i, dtype: int64

pandas provides a large set of vector functions that operate on all columns of a DataFrame or a single selected column (a pandas Series). These functions produce vectors of values for each of the columns, or a single Series for the individual Series. Examples:

### Element-wise max.

In [105]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [106]:
df12.max(axis = 1)

0    77
1    58
2    34
3    68
4    98
dtype: int64

In [107]:
df12.max(axis =0)

f     7
g     8
h    56
i    98
dtype: int64

### Element-wise min.

In [108]:
df12.min(axis = 1)

0    3
1    4
2    2
3    4
4    6
dtype: int64

In [109]:
df12.min(axis= 0)

f     3
g     2
h     4
i    34
dtype: int64

### Trim values at input thresholds

In [110]:
# df12.cut(lower = -10, upper = 10)

### Absolute value

In [111]:
df12.abs()

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

# Combine Datasets

### Join matching rows from bdf to adf.

In [160]:
adf = pd.DataFrame({'x1':[1,2,3], 'x2':['T', 'H', 'J']})
adf

   x1 x2
0   1  T
1   2  H
2   3  J

In [161]:
bdf = pd.DataFrame({'x1':[1,2,3], 'x2':['p', 'q', 'R']})
bdf

   x1 x2
0   1  p
1   2  q
2   3  R

In [162]:
pd.merge(adf, bdf, how = 'left', on = 'x1')

   x1 x2_x x2_y
0   1    T    p
1   2    H    q
2   3    J    R

In [115]:
pd.merge(adf, bdf, how = 'right', on = 'x1')

   x1 x2_x x2_y
0   1    T    p
1   2    H    q
2   3    J    R

In [116]:
pd.merge(adf, bdf, how = 'inner', on = 'x1')

   x1 x2_x x2_y
0   1    T    p
1   2    H    q
2   3    J    R

In [117]:
pd.merge(adf, bdf, how = 'outer')

   x1 x2
0   1  T
1   2  H
2   3  J
3   1  p
4   2  q
5   3  R

In [118]:
t = pd.merge(adf, bdf, how = 'outer', on = 'x1')
t

   x1 x2_x x2_y
0   1    T    p
1   2    H    q
2   3    J    R

In [119]:
t.fillna('as')

   x1 x2_x x2_y
0   1    T    p
1   2    H    q
2   3    J    R

In [120]:
cdf = pd.DataFrame({'x1':['A', 'B', 'C'], 'x2':[1,2,3]})
cdf

  x1  x2
0  A   1
1  B   2
2  C   3

In [121]:
ddf = pd.DataFrame({'x1':['A','B','C'], 'x2':['T', 'H', 'J']})
ddf

  x1 x2
0  A  T
1  B  H
2  C  J

In [122]:
frames = pd.concat([cdf, ddf], ignore_index = True)
frames

  x1 x2
0  A  1
1  B  2
2  C  3
3  A  T
4  B  H
5  C  J

In [123]:
# pd.merge(frames, how = 'right', on = 'x1')

In [124]:
cdf.merge(ddf, how = 'left', on = 'x1')

  x1  x2_x x2_y
0  A     1    T
1  B     2    H
2  C     3    J

In [125]:
cdf.merge(ddf, how = 'right', on = 'x1')

  x1  x2_x x2_y
0  A     1    T
1  B     2    H
2  C     3    J

In [126]:
cdf.merge(ddf, how = 'inner', on = 'x1')

  x1  x2_x x2_y
0  A     1    T
1  B     2    H
2  C     3    J

In [127]:
cdf.merge(ddf, how = 'outer', on = 'x1')

  x1  x2_x x2_y
0  A     1    T
1  B     2    H
2  C     3    J

In [128]:
cdf['key'] = 0

In [129]:
ddf['key'] = 0

In [130]:
cdf

  x1  x2  key
0  A   1    0
1  B   2    0
2  C   3    0

In [131]:
ddf

  x1 x2  key
0  A  T    0
1  B  H    0
2  C  J    0

In [132]:
cdf.merge(ddf, how = "left", on = 'key')

  x1_x  x2_x  key x1_y x2_y
0    A     1    0    A    T
1    A     1    0    B    H
2    A     1    0    C    J
3    B     2    0    A    T
4    B     2    0    B    H
5    B     2    0    C    J
6    C     3    0    A    T
7    C     3    0    B    H
8    C     3    0    C    J

# Filtering Joins

### All rows in adf that have a match in bdf.

In [133]:
adf

   x1 x2
0   1  T
1   2  H
2   3  J

In [134]:
bdf

   x1 x2
0   1  p
1   2  q
2   3  R

In [135]:
adf[adf.x1.isin(bdf.x1)]

   x1 x2
0   1  T
1   2  H
2   3  J

### All rows in adf that do not have a match in bdf.

In [136]:
adf[~adf.x1.isin(bdf.x1)]

Empty DataFrame
Columns: [x1, x2]
Index: []

# Group Data

### Return a GroupBy object, grouped by values in column named "col".

In [137]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [138]:
l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df13 = pd.DataFrame(l, columns=["a", "b", "c"])
df13

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [139]:
df13.groupby(by = 'b')

In [140]:
df13.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [141]:
df13.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [3]:
df14 = pd.DataFrame({'Animal': ['Falcon', 'Falcon', 'Parrot', 'Parrot'], 'Max Speed': [380., 370., 24., 26.]})
df14

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [5]:
np.mean([10, 20, 30])

20.0

In [143]:
df14.groupby(["Animal"]).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [6]:
df14.groupby("Animal", group_keys=True).apply(lambda x: x/2)

          Max Speed
Animal
Falcon 0      190.0
       1      185.0
Parrot 2       12.0
       3       13.0

In [163]:
df12.groupby(by = 'h')

In [164]:
df12

   f  g   h   i
0  3  8  22  77
1  4  5   4  58
2  5  2   5  34
3  6  4  12  68
4  7  6  56  98

In [146]:
df11

    l   m   n
0  12  45  12
1  12  45  12
2  14  15  15
3  16  16  16

### Return a GroupBy object, grouped by values in index level named "ind"

In [147]:
df14.groupby(by = 'Animal')

### Size of each group

In [148]:
df14.size

8

### Aggregate group using function.

In [149]:
df15 = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [np.nan, np.nan, np.nan]], columns=['A', 'B', 'C'])
df15

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [165]:
df15.agg(['sum', 'min', 'median'])

           A     B     C
sum     12.0  15.0  18.0
min      1.0   2.0   3.0
median   4.0   5.0   6.0

In [166]:
df15.agg(['mean', 'std'])

        A    B    C
mean  4.0  5.0  6.0
std   3.0  3.0  3.0

In [167]:
df15.agg({'A':['sum', 'min'], 'B': ['median', 'max']})

           A    B
sum     12.0  NaN
min      1.0  NaN
median   NaN  5.0
max      NaN  8.0

In [168]:
df15.agg('mean', axis = 'columns')

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

In [169]:
df16 = pd.DataFrame({"Col1": [10, 20, 15, 30, 45], "Col2": [13, 23, 18, 33, 48], "Col3": [17, 27, 22, 37, 52]},
                  index=pd.date_range("2020-01-01", "2020-01-05"))
df16

            Col1  Col2  Col3
2020-01-01    10    13    17
2020-01-02    20    23    27
2020-01-03    15    18    22
2020-01-04    30    33    37
2020-01-05    45    48    52

In [170]:
df16.shift(periods = 2)

            Col1  Col2  Col3
2020-01-01   NaN   NaN   NaN
2020-01-02   NaN   NaN   NaN
2020-01-03  10.0  13.0  17.0
2020-01-04  20.0  23.0  27.0
2020-01-05  15.0  18.0  22.0

In [171]:
df16.shift(periods = 3, axis = 'columns')

            Col1  Col2  Col3
2020-01-01   NaN   NaN   NaN
2020-01-02   NaN   NaN   NaN
2020-01-03   NaN   NaN   NaN
2020-01-04   NaN   NaN   NaN
2020-01-05   NaN   NaN   NaN

In [172]:
df16.shift(periods=3, fill_value = 0)

            Col1  Col2  Col3
2020-01-01     0     0     0
2020-01-02     0     0     0
2020-01-03     0     0     0
2020-01-04    10    13    17
2020-01-05    20    23    27

In [173]:
df16.shift(periods = 3, freq = 'B')

            Col1  Col2  Col3
2020-01-06    10    13    17
2020-01-07    20    23    27
2020-01-08    15    18    22
2020-01-08    30    33    37
2020-01-08    45    48    52

In [174]:
df16.shift(periods = 3, freq = 'D')

            Col1  Col2  Col3
2020-01-04    10    13    17
2020-01-05    20    23    27
2020-01-06    15    18    22
2020-01-07    30    33    37
2020-01-08    45    48    52

In [175]:
df16.shift(1)

            Col1  Col2  Col3
2020-01-01   NaN   NaN   NaN
2020-01-02  10.0  13.0  17.0
2020-01-03  20.0  23.0  27.0
2020-01-04  15.0  18.0  22.0
2020-01-05  30.0  33.0  37.0

In [176]:
df16.shift(-1)

            Col1  Col2  Col3
2020-01-01  20.0  23.0  27.0
2020-01-02  15.0  18.0  22.0
2020-01-03  30.0  33.0  37.0
2020-01-04  45.0  48.0  52.0
2020-01-05   NaN   NaN   NaN

### Ranks with no gaps

In [ ]:
df16.rank(method = 'dense')

### Ranks. Ties get min rank

In [ ]:
df16.rank(method = 'min')

In [ ]:
df16.rank(method = 'max')

### Ranks rescaled to interval [0, 1]

In [ ]:
df16.rank(pct = True)

### Ranks. Ties go to first value

In [ ]:
df16.rank(method = 'first')

### Cumulative sum

In [ ]:
df16

In [ ]:
df16.cumsum()

### Cumulative max

In [ ]:
df16.cummax()

### Cumulative min

In [ ]:
df16.cummin()

### Cumulative product

In [ ]:
df16.cumprod()

# Windows

### df.expanding() Return an Expanding object allowing summary functions to be applied cumulatively

In [ ]:
df16.expanding()

In [ ]:
df16.expanding(1).sum()

In [ ]:
df16.expanding(2).sum()

### Return a Rolling object allowing summary functions to be applied to windows of length n.

In [ ]:
df16.rolling(2)

### Plotting

### Histogram for each column

In [ ]:
df16.plot.hist()

### Scatter chart using pairs of point

In [ ]:
df16

In [ ]:
df16.plot.scatter(x = 'Col1', y = 'Col2')